//최댓값 : 320580266032658717156114439753831705658779984253920374290520601088075796800 : 75자리
//위 값을 1234567891로 나눠야 함
//15829 부분성공

#include <stdio.h>

int main()
{  
    int l; scanf("%d", &l);
    char str[50]; scanf("%s", str);
    unsigned long long int hash = 0;

    unsigned long long int a = 1;

    for(int i = 0; i < l; i++)
    {   
        for(int j = 0; j < i; j++)
        {
            a *= 31;
            a %= 1234567891;
        }
        hash += (a * (str[i] - 'a' + 1));
        a = 1;
    }
    printf("%llu\n", hash % 1234567891);
}

/*
전체를 다 더하고 나눔: 1+2+3+4+5+6+7+8+9+10 % 7 == 55 % 7 = 6
각각 나눔: 1+2+3+4+5+6+0+1+2+3 = 27(나누는 값보다 커짐) -> 27 % 7 = 6 (마지막에 한번 더 나눔)

*/